; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v3 - type_1 ?v5 - type_3)
 	      (pred_2 ?v8 - object ?v5 - type_3)
	      (pred_3 ?v3 - type_1 ?v1 - type_2)
	      (pred_1 ?v3 - type_1 ?v8 - object ?v1 - type_2))

   (:action op_3
       :parameters  (?v3 - type_1 ?v7 ?v4 - type_3)
       :precondition (and  (pred_4 ?v3 ?v7))
       :effect (and  (pred_4 ?v3 ?v4)
		     (not (pred_4 ?v3 ?v7))))

   (:action op_1
       :parameters (?v3 - type_1 ?v2 - object ?v6 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v6) (pred_4 ?v3 ?v6) (pred_3 ?v3 ?v1))
       :effect (and (pred_1 ?v3 ?v2 ?v1)
		    (not (pred_2 ?v2 ?v6)) 
		    (not (pred_3 ?v3 ?v1))))

   (:action op_2
       :parameters (?v3 - type_1 ?v2 - object ?v6 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v2 ?v1) (pred_4 ?v3 ?v6))
       :effect (and (pred_2 ?v2 ?v6)
		    (pred_3 ?v3 ?v1)
		    (not (pred_1 ?v3 ?v2 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_03 - type_1
obj_06 obj_02 obj_14 obj_12 - type_2
obj_13 obj_04 obj_10 obj_01 - type_3
obj_09 obj_11 obj_08 obj_05 - object)
(:init
(pred_4 obj_07 obj_10)
(pred_3 obj_07 obj_06)
(pred_3 obj_07 obj_02)
(pred_4 obj_03 obj_10)
(pred_3 obj_03 obj_14)
(pred_3 obj_03 obj_12)
(pred_2 obj_09 obj_10)
(pred_2 obj_11 obj_13)
(pred_2 obj_08 obj_01)
(pred_2 obj_05 obj_13)
)
(:goal
(and
(pred_2 obj_09 obj_04)
(pred_2 obj_11 obj_01)
(pred_2 obj_08 obj_13)
(pred_2 obj_05 obj_10)
)
)

(:constraints
  (always (not (pred_4 obj_07 obj_01)))
)
)

; plan
1. (op_1 obj_07 obj_09 obj_10 obj_02)
   deleted: (pred_2 obj_09 obj_10) (pred_3 obj_07 obj_02)
   added: (pred_1 obj_07 obj_09 obj_02)
   goals met: 0 of 4
2. (op_3 obj_03 obj_10 obj_01)
   deleted: (pred_4 obj_03 obj_10)
   added: (pred_4 obj_03 obj_01)
   goals met: 0 of 4
3. (op_3 obj_07 obj_10 obj_04)
   deleted: (pred_4 obj_07 obj_10)
   added: (pred_4 obj_07 obj_04)
   goals met: 0 of 4
4. (op_1 obj_03 obj_08 obj_01 obj_12)
   deleted: (pred_2 obj_08 obj_01) (pred_3 obj_03 obj_12)
   added: (pred_1 obj_03 obj_08 obj_12)
   goals met: 0 of 4
5. (op_2 obj_07 obj_09 obj_04 obj_02)
   deleted: (pred_1 obj_07 obj_09 obj_02)
   added: (pred_2 obj_09 obj_04) (pred_3 obj_07 obj_02)
   goals met: 1 of 4
6. (op_3 obj_03 obj_01 obj_13)
   deleted: (pred_4 obj_03 obj_01)
   added: (pred_4 obj_03 obj_13)
   goals met: 1 of 4
7. (op_2 obj_03 obj_08 obj_13 obj_12)
   deleted: (pred_1 obj_03 obj_08 obj_12)
   added: (pred_2 obj_08 obj_13) (pred_3 obj_03 obj_12)
   goals met: 2 of 4
8. (op_1 obj_03 obj_05 obj_13 obj_14)
   deleted: (pred_2 obj_05 obj_13) (pred_3 obj_03 obj_14)
   added: (pred_1 obj_03 obj_05 obj_14)
   goals met: 2 of 4
9. (op_1 obj_03 obj_11 obj_13 obj_12)
   deleted: (pred_2 obj_11 obj_13) (pred_3 obj_03 obj_12)
   added: (pred_1 obj_03 obj_11 obj_12)
   goals met: 2 of 4
10. (op_3 obj_03 obj_13 obj_01)
   deleted: (pred_4 obj_03 obj_13)
   added: (pred_4 obj_03 obj_01)
   goals met: 2 of 4
11. (op_2 obj_03 obj_11 obj_01 obj_12)
   deleted: (pred_1 obj_03 obj_11 obj_12)
   added: (pred_2 obj_11 obj_01) (pred_3 obj_03 obj_12)
   goals met: 3 of 4
12. (op_3 obj_03 obj_01 obj_10)
   deleted: (pred_4 obj_03 obj_01)
   added: (pred_4 obj_03 obj_10)
   goals met: 3 of 4
13. (op_2 obj_03 obj_05 obj_10 obj_14)
   deleted: (pred_1 obj_03 obj_05 obj_14)
   added: (pred_2 obj_05 obj_10) (pred_3 obj_03 obj_14)
   goals met: 4 of 4
